<?php

return [
    // Общие сообщения
    'list_retrieved' => 'Список спецификаций успешно получен',
    'created' => 'Спецификация успешно создана',
    'updated' => 'Спецификация успешно обновлена',
    'deleted' => 'Спецификация успешно удалена',
    'not_found' => 'Спецификация не найдена',
    
    // Ошибки
    'internal_error_list' => 'Внутренняя ошибка сервера при получении списка спецификаций. Пожалуйста, свяжитесь с технической поддержкой',
    'internal_error_create' => 'Внутренняя ошибка сервера при создании спецификации. Пожалуйста, свяжитесь с технической поддержкой',
    'internal_error_get' => 'Внутренняя ошибка сервера при получении спецификации. Пожалуйста, свяжитесь с технической поддержкой',
    'internal_error_update' => 'Внутренняя ошибка сервера при обновлении спецификации. Пожалуйста, свяжитесь с технической поддержкой',
    'internal_error_delete' => 'Внутренняя ошибка сервера при удалении спецификации. Пожалуйста, свяжитесь с технической поддержкой',
];
