<?php

return [
    // Общие сообщения
    'list_retrieved' => 'Список поставщиков успешно получен',
    'created' => 'Поставщик успешно создан',
    'updated' => 'Поставщик успешно обновлен',
    'deleted' => 'Поставщик успешно удален',
    'not_found' => 'Поставщик не найден',
    'update_failed' => 'Поставщик не найден или не удалось обновить',
    'delete_failed' => 'Поставщик не найден или не удалось удалить',
    
    // Ошибки
    'internal_error_list' => 'Внутренняя ошибка сервера при получении списка поставщиков. Пожалуйста, свяжитесь с технической поддержкой',
    'internal_error_create' => 'Внутренняя ошибка сервера при создании поставщика. Пожалуйста, свяжитесь с технической поддержкой',
    'internal_error_get' => 'Внутренняя ошибка сервера при получении поставщика. Пожалуйста, свяжитесь с технической поддержкой',
    'internal_error_update' => 'Внутренняя ошибка сервера при обновлении поставщика. Пожалуйста, свяжитесь с технической поддержкой',
    'internal_error_delete' => 'Внутренняя ошибка сервера при удалении поставщика. Пожалуйста, свяжитесь с технической поддержкой',
];
